# Définir le bon type de données pour les colonnes catégorielles

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../_datasets/titanic_train.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.Gender.dtype

dtype('O')

In [5]:
df.Gender.info(memory_usage="deep")

<class 'pandas.core.series.Series'>
RangeIndex: 1500 entries, 0 to 1499
Series name: Gender
Non-Null Count  Dtype
--------------  -----
1500 non-null   object
dtypes: object(1)
memory usage: 90.5 KB

In [6]:
df["Gender"] = df.Gender.astype("category")

In [7]:
df.Gender.info(memory_usage="deep")

<class 'pandas.core.series.Series'>
RangeIndex: 1500 entries, 0 to 1499
Series name: Gender
Non-Null Count  Dtype
--------------  -----
1500 non-null   category
dtypes: category(1)
memory usage: 1.8 KB